<a href="https://colab.research.google.com/github/Ferdib-Al-Islam/crime-data-visualization-and-analysis/blob/master/sowrozit_crime_tamilnadu.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt
from sklearn.preprocessing import scale
from numpy import random, float, array
import numpy as np
import seaborn as sns

In [0]:
data = pd.read_csv('TamilNadu_Crime_Data_2001_2012.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1440 entries, 0 to 1439
Data columns (total 7 columns):
CRIME_YEAR                           1440 non-null int64
CRIME_STATE                          1440 non-null object
CRIME_CITY                           1440 non-null object
CRIME_CITY_LATTITUDE                 1440 non-null float64
CRIME_CITY_LONGTITUDE                1440 non-null float64
CRIME_TYPE                           1440 non-null object
NUMBER_OF_CRIME_IN_THE_CRIME_TYPE    1440 non-null int64
dtypes: float64(2), int64(2), object(3)
memory usage: 78.9+ KB

In [4]:
data.describe()

        CRIME_YEAR  ...  NUMBER_OF_CRIME_IN_THE_CRIME_TYPE
count  1440.000000  ...                        1440.000000
mean   2006.500000  ...                         178.763194
std       3.453252  ...                         398.961224
min    2001.000000  ...                           0.000000
25%    2003.750000  ...                          10.000000
50%    2006.500000  ...                          43.000000
75%    2009.250000  ...                         125.500000
max    2012.000000  ...                        3779.000000

[8 rows x 4 columns]

In [5]:
data.head()

   CRIME_YEAR  ... NUMBER_OF_CRIME_IN_THE_CRIME_TYPE
0        2001  ...                                91
1        2001  ...                               298
2        2001  ...                                 0
3        2001  ...                                28
4        2001  ...                                28

[5 rows x 7 columns]

In [0]:
#Number of crimes vs. years for six Tamilnadu cities